src/QLThoiKhoaBieu/src/jbiasa/QLThoiKhoaBieu.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="QLThoiKhoaBieu"
             xmlns:tns="QLThoiKhoaBieu" xmlns:ns="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/ThemThoiKhoaBieu" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/LayThoiKhoaBieuTheoLop">
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/ThemThoiKhoaBieu" location="../jbiServiceUnits/QuanLyThoiKhoaBieu/interface_WSDL/ThemThoiKhoaBieu.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyThoiKhoaBieu/LayThoiKhoaBieuTheoLop" location="../jbiServiceUnits/QuanLyThoiKhoaBieu/interface_WSDL/LayThoiKhoaBieuTheoLop.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:ThemThoiKhoaBieuPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ThemThoiKhoaBieuOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns1:LayThoiKhoaBieuTheoLopPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="LayThoiKhoaBieuTheoLopOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QLThoiKhoaBieu"/>
            </output>
        </operation>
    </binding>
    <service name="QLThoiKhoaBieuService1">
        <port name="TaoThoiKhoaBieu" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/QLThoiKhoaBieuService1/TaoThoiKhoaBieu"/>
        </port>
    </service>
    <service name="QLThoiKhoaBieuService2">
        <port name="XemThoiKhoaBieu" binding="tns:casaBinding2">
            <soap:address location="http://localhost:${HttpDefaultPort}/QLThoiKhoaBieuService2/XemThoiKhoaBieu"/>
        </port>
    </service>
</definitions>

