src/QLThoiKhoaBieu/test/themTKB/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qlt="QLThoiKhoaBieu" xmlns:esc="http://xml.netbeans.org/schema/EschoolinkObject">
  <soapenv:Body>
    <qlt:ThemThoiKhoaBieuOperation>
      <part1>
        <esc:idThoiKhoaBieu>?10?</esc:idThoiKhoaBieu>
        <esc:tenLop>10A10</esc:tenLop>
        <esc:idNamHoc>2</esc:idNamHoc>
        <esc:hocKy>2</esc:hocKy>
        <!--Zero or more repetitions:-->

        <esc:ChiTietThoiKhoaBieu>
          <esc:id_chitietthoikhoabieu>?10?</esc:id_chitietthoikhoabieu>
          <esc:giaoviengiangday>Tran Van A</esc:giaoviengiangday>
          <esc:monhoc>Toan</esc:monhoc>
          <esc:sotiet>3</esc:sotiet>
          <esc:thu>2</esc:thu>
          <esc:tietThuMay>1</esc:tietThuMay>
        </esc:ChiTietThoiKhoaBieu>

         <esc:ChiTietThoiKhoaBieu>
          <esc:id_chitietthoikhoabieu>?10?</esc:id_chitietthoikhoabieu>
          <esc:giaoviengiangday>Tran Van B</esc:giaoviengiangday>
          <esc:monhoc>Ly</esc:monhoc>
          <esc:sotiet>3</esc:sotiet>
          <esc:thu>2</esc:thu>
          <esc:tietThuMay>4</esc:tietThuMay>
        </esc:ChiTietThoiKhoaBieu>
      </part1>
    </qlt:ThemThoiKhoaBieuOperation>
  </soapenv:Body>
</soapenv:Envelope>